       IDENTIFICATION DIVISION.
       PROGRAM-ID. MODELO.
       AUTHOR. Seu nome.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       SCREEN SECTION.
       PROCEDURE DIVISION.
       P-INICIO.
           DISPLAY "Ola, Mundo!".
      **************************
      * Rotinas de finalização *
      **************************
       P-FIM-EXIT.
           EXIT PROGRAM.
       P-FIM-STOP-RUN.
           STOP RUN.