      * Hello World.
       IDENTIFICATION DIVISION.
           PROGRAM-ID. TESTE.
       PROCEDURE DIVISION.
           DISPLAY 'HELLO WORD'.
           STOP RUN.